/* console.clear();

const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

const arrCheck = Object.keys(arr);

const randomElement = Math.round(Math.random() * arr.length); // Создаем переменную которая принимает в себя следущее значение
// для начала прописываем метод math.random и задаем ему длинну нашего массива
// после этого мы округляем наше число при помощи метода math.round (округляет число в зависимости от его значения после запятой, 
// если больше половины то округляет вверх, если меньше то вниз)

const arrRandom = arr[randomElement];

if (arr.length === 0) {
  console.log("Массив пустой!")
} else {
  console.log(arrRandom);
} */

//----------------------------------------2 задание -------------------------------------------
